Prac 1

Step 1: Test connectivity. All devices should be able to ping all other IP addresses. 

Step 2: 
R1(config)#router ospf 1
R1(config-router)#network 192.168.1.0 0.0.0.255 area 0
R1(config-router)#network 10.1.1.0 0.0.0.3 area 0

Router(config)#router ospf 2
Router(config-router)#network 10.1.1.0 0.0.0.3 area 0
Router(config-router)#network 10.2.2.0 0.0.0.3 area 0

R3(config)#router ospf 3
R3(config-router)#network 192.168.3.0 0.0.0.255 area 0
R3(config-router)#network 10.2.2.0 0.0.0.3 area 0

Configure OSPF MD5 Authentication 

step 1:
R1(config)# router ospf 1
R1(config-router)# area 0 authentication message-digest
R2(config)# router ospf 1
R2(config-router)# area 0 authentication message-digest
R3(config)# router ospf 1
R3(config-router)# area 0 authentication message-digest

step 2:
R1(config)# interface s0/0/0
R1(config-if)# ip ospf message-digest-key 1 md5 MD5pa55

R2(config)# interface s0/0/0
R2(config-if)# ip ospf message-digest-key 1 md5 MD5pa55
R2(config-if)# interface s0/0/1
R2(config-if)# ip ospf message-digest-key 1 md5 MD5pa55

R3(config)# interface s0/0/1
R3(config-if)# ip ospf message-digest-key 1 md5 MD5pa55

step 3:
a. Verify the MD5 authentication configurations using the commands show ip ospf interface. 
b. Verify end-to-end connectivity. 


Configure NTP

step 1:
R1(config)# ntp server 192.168.1.5
R1(config)# ntp update-calendar

step2:
R1(config)# ntp authenticate
R1(config)# ntp trusted-key 1
R1(config)# ntp authentication-key 1 md5 NTPpa55

R2(config)# ntp authenticate
R2(config)# ntp trusted-key 1
R2(config)# ntp authentication-key 1 md5 NTPpa55

R3(config)# ntp authenticate
R3(config)# ntp trusted-key 1
R3(config)# ntp authentication-key 1 md5 NTPpa55

show clock

R1(config)# service timestamps log datetime msec
R2(config)# service timestamps log datetime msec
R3(config)# service timestamps log datetime msec



Configure Routers to Log Messages to the Syslog Server

step 1:
R1(config)# logging host 192.168.1.6
R2(config)# logging host 192.168.1.6
R3(config)# logging host 192.168.1.6



Part 4: Configure R3 to Support SSH Connections 

step 1:
R3(config)# ip domain-name ccnasecurity.com

step 2:
R3(config)# username SSHadmin privilege 15 secret ciscosshpa55

step 3:
R3(config)# line vty 0 4
R3(config-line)# login local
R3(config-line)# transport input ssh

step 4:
R3(config)# crypto key zeroize rsa

step 5:
R3(config)# crypto key generate rsa

step 6:
show ip ssh

step 7:
R3(config)# ip ssh time-out 90
R3(config)# ip ssh authentication-retries 2
R3(config)# ip ssh version 2

step 8:
PC> telnet 192.168.3.1

step 9:
PC> ssh –l SSHadmin 192.168.3.1

step 10:
R2# ssh –v 2 –l SSHadmin 10.2.2.1


